# practise_chapter_05.ipynb

## SETUP

In [75]:
import pandas as pd

In [76]:
ds = pd.read_csv(
    "../data/daily-minimum-temperatures.csv", header=0, index_col=0, parse_dates=True
).squeeze()
ds

Date
1981-01-01    20.7
1981-01-02    17.9
1981-01-03    18.8
1981-01-04    14.6
1981-01-05    15.8
              ...
1990-12-27    14.0
1990-12-28    13.6
1990-12-29    13.5
1990-12-30    15.7
1990-12-31    13.0
Name: Temp, Length: 3650, dtype: float64

## DATAFRAME

In [77]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [78]:
ds.iloc[0]

20.7

In [79]:
df["month"] = [ds.index[i].month for i in range(len(ds))]
df["day"] = [ds.index[i].day for i in range(len(ds))]
df["year"] = [ds.index[i].year for i in range(len(ds))]
df["temperature"] = [ds.iloc[i] for i in range(len(ds))]

In [80]:
df.head()

   month  day  year  temperature
0      1    1  1981         20.7
1      1    2  1981         17.9
2      1    3  1981         18.8
3      1    4  1981         14.6
4      1    5  1981         15.8

## SERIES

In [81]:
ds

Date
1981-01-01    20.7
1981-01-02    17.9
1981-01-03    18.8
1981-01-04    14.6
1981-01-05    15.8
              ...
1990-12-27    14.0
1990-12-28    13.6
1990-12-29    13.5
1990-12-30    15.7
1990-12-31    13.0
Name: Temp, Length: 3650, dtype: float64

## LAG

In [82]:
ds.values

array([20.7, 17.9, 18.8, ..., 13.5, 15.7, 13. ])

In [83]:
temps = pd.DataFrame(ds.values)
temps

         0
0     20.7
1     17.9
2     18.8
3     14.6
4     15.8
...    ...
3645  14.0
3646  13.6
3647  13.5
3648  15.7
3649  13.0

[3650 rows x 1 columns]

In [84]:
df = pd.concat([temps.shift(3), temps.shift(2), temps.shift(1), temps], axis=1)
df

         0     0     0     0
0      NaN   NaN   NaN  20.7
1      NaN   NaN  20.7  17.9
2      NaN  20.7  17.9  18.8
3     20.7  17.9  18.8  14.6
4     17.9  18.8  14.6  15.8
...    ...   ...   ...   ...
3645  10.0  12.9  14.6  14.0
3646  12.9  14.6  14.0  13.6
3647  14.6  14.0  13.6  13.5
3648  14.0  13.6  13.5  15.7
3649  13.6  13.5  15.7  13.0

[3650 rows x 4 columns]

In [85]:
df.columns = ["t-2", "t-1", "t", "t+1"]
df.head()

    t-2   t-1     t   t+1
0   NaN   NaN   NaN  20.7
1   NaN   NaN  20.7  17.9
2   NaN  20.7  17.9  18.8
3  20.7  17.9  18.8  14.6
4  17.9  18.8  14.6  15.8

## ROLLING

In [88]:
temps = pd.DataFrame(ds.values)
temps

         0
0     20.7
1     17.9
2     18.8
3     14.6
4     15.8
...    ...
3645  14.0
3646  13.6
3647  13.5
3648  15.7
3649  13.0

[3650 rows x 1 columns]

In [89]:
width = 3

In [92]:
shifted = temps.shift(width - 1)
shifted

         0
0      NaN
1      NaN
2     20.7
3     17.9
4     18.8
...    ...
3645  12.9
3646  14.6
3647  14.0
3648  13.6
3649  13.5

[3650 rows x 1 columns]

In [94]:
window = shifted.rolling(window=width)
window

Rolling [window=3,center=False,axis=0,method=single]

In [103]:
df = pd.concat([window.min(), window.mean(), window.max(), temps], axis=1)
df.columns = ["min", "mean", "max", "t+1"]
df.head()

    min       mean   max   t+1
0   NaN        NaN   NaN  20.7
1   NaN        NaN   NaN  17.9
2   NaN        NaN   NaN  18.8
3   NaN        NaN   NaN  14.6
4  17.9  19.133333  20.7  15.8

## WINDOW

In [ ]:
#
temps = pd.DataFrame(ds.values)
temps

         0
0     20.7
1     17.9
2     18.8
3     14.6
4     15.8
...    ...
3645  14.0
3646  13.6
3647  13.5
3648  15.7
3649  13.0

[3650 rows x 1 columns]

In [ ]:
temps.expanding()

Expanding [min_periods=1,axis=0,method=single]

In [ ]:
temps

         0
0     20.7
1     17.9
2     18.8
3     14.6
4     15.8
...    ...
3645  14.0
3646  13.6
3647  13.5
3648  15.7
3649  13.0

[3650 rows x 1 columns]

In [ ]:
window = temps.expanding()
df = pd.concat(
    [temps, window.min(), window.mean(), window.max(), temps.shift(-1)], axis=1
)
df.columns = ["temps", "min", "mean", "max", "t+1"]
df.head()

   temps   min       mean   max   t+1
0   20.7  20.7  20.700000  20.7  17.9
1   17.9  17.9  19.300000  20.7  18.8
2   18.8  17.9  19.133333  20.7  14.6
3   14.6  14.6  18.000000  20.7  15.8
4   15.8  14.6  17.560000  20.7  15.8